{"id":6694,"date":"2020-10-14T06:05:00","date_gmt":"2020-10-14T06:05:00","guid":{"rendered":"http:\/\/bookmyconsultants.com\/?p=6694"},"modified":"2021-04-09T07:25:24","modified_gmt":"2021-04-09T07:25:24","slug":"all-about-tcs-on-sales-consideration-under-section-206-c1h-with-faqs","status":"publish","type":"post","link":"https:\/\/bookmyconsultants.com\/all-about-tcs-on-sales-consideration-under-section-206-c1h-with-faqs\/","title":{"rendered":"All About TCS on Sales Consideration under section 206 C(1H) With FAQ&#8217;S"},"content":{"rendered":"\t\t<div data-elementor-type=\"wp-post\" data-elementor-id=\"6694\" class=\"elementor elementor-6694\" data-elementor-settings=\"[]\">\n\t\t\t\t\t\t<div class=\"elementor-inner\">\n\t\t\t\t\t\t\t<div class=\"elementor-section-wrap\">\n\t\t\t\t\t\t\t<section class=\"elementor-section elementor-top-section elementor-element elementor-element-634467a4 elementor-section-boxed elementor-section-height-default elementor-section-height-default parallax_section_no qodef_elementor_container_no\" data-id=\"634467a4\" data-element_type=\"section\">\n\t\t\t\t\t\t<div class=\"elementor-container elementor-column-gap-default\">\n\t\t\t\t\t\t\t<div class=\"elementor-row\">\n\t\t\t\t\t<div class=\"elementor-column elementor-col-100 elementor-top-column elementor-element elementor-element-6328561c\" data-id=\"6328561c\" data-element_type=\"column\">\n\t\t\t<div class=\"elementor-column-wrap elementor-element-populated\">\n\t\t\t\t\t\t\t<div class=\"elementor-widget-wrap\">\n\t\t\t\t\t\t<div class=\"elementor-element elementor-element-361fd053 elementor-widget elementor-widget-text-editor\" data-id=\"361fd053\" data-element_type=\"widget\" data-widget_type=\"text-editor.default\">\n\t\t\t\t<div class=\"elementor-widget-container\">\n\t\t\t\t\t\t\t\t<div class=\"elementor-text-editor elementor-clearfix\">\n\t\t\t\t<p>Vide the Finance Act, 2020, a new provision under section 206C(1H) was introduced for Collection of Tax at Source on Sale of Goods by a seller(whose Aggregate Gross Receipts or Sales or Turnover in preceding Financial Year exceeds `10 crores), from the buyers, from whom he has received any amount as Consideration for Sale exceeding ` 50 lakhs during the year. The aforesaid provisions are applicable from the 1st day of October 2020. The above sale of goods excludes the Sale of Motor Vehicles and other specified goods.<\/p>\t\t\t\t\t<\/div>\n\t\t\t\t\t\t<\/div>\n\t\t\t\t<\/div>\n\t\t\t\t<div class=\"elementor-element elementor-element-e93f6e7 elementor-widget elementor-widget-qodef_separator\" data-id=\"e93f6e7\" data-element_type=\"widget\" data-widget_type=\"qodef_separator.default\">\n\t\t\t\t<div class=\"elementor-widget-container\">\n\t\t\t<div class=\"qodef-separator-holder clearfix  qodef-separator-center qodef-separator-normal\">\n\t<div class=\"qodef-separator\" ><\/div>\n<\/div>\n\t\t<\/div>\n\t\t\t\t<\/div>\n\t\t\t\t<div class=\"elementor-element elementor-element-086a7ca elementor-widget elementor-widget-text-editor\" data-id=\"086a7ca\" data-element_type=\"widget\" data-widget_type=\"text-editor.default\">\n\t\t\t\t<div class=\"elementor-widget-container\">\n\t\t\t\t\t\t\t\t<div class=\"elementor-text-editor elementor-clearfix\">\n\t\t\t\t<ol><li><strong>Who is liable to collect Tax?<\/strong><\/li><\/ol><p>Every person who is a seller. It means the seller may be an individual or HUF or Firm or LLP or Company or Association Of Persons or Artificial Juridical Person or Local Authority or a Charitable Trust, whether  Resident or Non-Resident.<\/p><p> <\/p><ol start=\"2\"><li><strong>Whether all the sellers are liable to collect the tax and remit to the Government of India?<\/strong><\/li><\/ol><p>The seller whose total sales, gross receipts or turnover for the business carried on by him exceeds 10 crores during the Financial Year immediately preceding the Financial year in which the sale of goods are carried out.<\/p><p><strong>For Example, <\/strong>The Current Financial Year is 2020-21. If the total sales or gross receipts from the Business for the Financial Year 2019-20 exceed 10 crores, then the seller is liable to collect the TCS and remit to the Government irrespective of the Current Financial Year 2020- 21 Total Sales or Gross Receipts or Turnover. It may be less than or equal to or more than  10 crores.<\/p><p> <\/p><p><strong>3. Whether any of the sellers is exempted from this provision?<\/strong><\/p><p> <\/p><p>Central Government by notification in its Official Gazette can exempt or exempt the category of any of the other persons subject to such conditions as may be specified in that notification.<\/p><p> <\/p><p><strong>    4. From whom this Tax shall be collected?<\/strong><\/p><p>             The tax must be collected by the seller from the buyer from whom he has received any amount as consideration for sale of any goods of the value or aggregate of such value exceeding ` 50 lakhs during the Previous Year.<\/p><p> <\/p><p><strong>5. What are the Sales exempted from this provision?<\/strong><\/p><p>               Following Sales are exempted:<\/p><p>                       i. Sale of goods being exported out of India, or<\/p><p>                       ii. Sale of the following goods mentioned in 206C(1)<\/p><p>                              a. Alcoholic Liquor for human consumption<\/p><p>                              b. Tendu leaves<\/p><p>                              c. Timber obtained under a forest lease<\/p><p>                              d. Timber obtained by any mode other<\/p><p>                              e. Any other forest produce not being<\/p><p>                              f. Scrap<\/p><p>                              g. Minerals, being coal or lignite or iron ore or<\/p><p>        iii. Remittance of money through an Authorised Dealer through Liberalised Remittance Scheme mentioned in  206C(1G)<\/p><p>                  iv. Seller of Overseas Tour Package u\/s 206C (1G)(b), and<\/p><p>         v. Every Seller who is making sale of Motor Vehicles value exceeding 10 lakhs and is liable to collect tax under section       206C(1F).<\/p><p> <\/p><p><strong>6.  Where a seller who has more than one line of business and for each line of business, there is a Separate  Books of Accounts, in that case how to apply the Turnover Limit of <\/strong>` <strong>10 crores?<\/strong><\/p><p> <\/p><p>As per the Law, “Seller means a person whose total sales or gross receipts or turnover from the business carried by him exceed 10 crores” From the above, the total sales or gross receipts or turnover shall be seen for an assessee as a whole – Aggregate of total Sales or Gross Receipts or Turnover of all the business under one PAN exceed 10 crores in the last financial year, then this provision shall apply for the entire business.<\/p><p> <\/p><ol start=\"7\"><li><strong>Where the Seller receives Consideration of Sale from the same buyer for different lines of business for which he maintains Separate Books of Accounts, whether the Limit of Sale Consideration from the buyer shall apply independently for each line of Business?<\/strong><\/li><\/ol><p> <\/p><p>According to Section 206C(1H), the Buyer means a person who purchases any goods from the seller and that seller who receives an amount as consideration for sale of any goods of the value or aggregate of such value exceeding 50 lakhs. From the above, if the seller receives Consideration from the buyer for a value exceeding ` 50 lakhs in aggregate during the Financial Year, from all the line of business irrespective of the Separate Set of  Books of Accounts, this provision shall apply.<\/p><p> <\/p><ol start=\"8\"><li><strong>What is the rate at which Tax is to be collected from the Buyer and at what point of time?<\/strong><\/li><\/ol><p>   The seller shall collect from the buyer at the time of receipt of Sale Consideration, and shall collect the following–<\/p><p><strong>                 Situation Rate of TCS<\/strong><\/p><p>              If  the Buyer provides PAN or AADHAR Number<\/p><p>a sum equal to 0.1 percent of the Sale Consideration exceeding ` 50 lakhs <strong>For Financial Year 2020-21 – 0.075% instead of 0.1 % as per the Press Release of CB DT Dated 13th May 2020<\/strong><\/p><p>If Buyer does not provide PAN or AADHAR<\/p><p>Number a sum equal to 1 percent of the Sale Consideration exceeding ` 50 lakhs<\/p><p> <\/p><p><strong>9.      Who are the buyers exempted?<\/strong><\/p><p>           The following Buyers are exempted:<\/p><ul><li>Sale consideration from the buyer in an aggregate doesn’t exceed ` 50 lakhs<\/li><li>The Buyer is liable to deduct tax under the provisions of this Act on the goods purchased from the seller and has deducted such amount.<\/li><li>the Central Government, a State Government, an embassy, a High Commission, legation, commission, consulate and the trade representation of a foreign State; or<\/li><li>a local authority as defined in the Explanation to clause (20) of section 10; or<\/li><li>a person importing goods into India or any other person as the Central Government may, by notification in the Official Gazette, specify for this purpose, subject to such conditions as may be specified therein;<\/li><\/ul><p> <\/p><p><strong>10.    At what point of time shall the Seller collect TC S of 0.1%?<\/strong><\/p><p>              The TCS shall be collected at the time of receipt of Sales Consideration from the Buyer,<\/p><p> <\/p><p><strong>11.    Whether the Seller shall charge the TC S of 0.1% on the Sale Invoice and add it to the value of Invoice?<\/strong><\/p><p>The levy u\/s 206C (1H) is not a levy on sale. It is a mode of recovery of Income Tax on the Sale of goods by the seller made to the buyer. It is advisable that the Sales Invoice shall have the following Clause as the Terms and Conditions of Sales. If the aggregate Purchase by the buyer exceeds ` 50 lakhs during the Current Financial Year,<\/p><p>The buyer shall pay 0.1% as Tax Collected at Source u\/s 206C(1H) along with the sales consideration remittance in excess of ` 50 lakhs during that Financial year. Otherwise, TCS shall be adjusted 1st with the Consideration received amount and the balance to be adjusted to Sale Consideration due by using the following Formula TCS Amount = Amount Received x 0.1% \/100.1% <strong>For Financial Year 2020-21 –<\/strong> <strong>0.075% is the reduced rate of<\/strong> <strong>TC S as per the Press Release of<\/strong> <strong>CB DT Dated 13th May 2020<\/strong> TCS Amount = Amount Received x 0.075%\/100.075%<\/p><p> <\/p><ol start=\"12\"><li><strong>For the Financial Year<\/strong> <strong>2020-21, the law is applicable<\/strong> <strong>from 1st October 2020 and the aggregate Sale     <\/strong><strong>Consideration of exceeding 50 lakhs shall be considered from 1st April 2020 or 1st October 2020?<\/strong><\/li><\/ol><p>In our opinion, the aggregate Sales Consideration is prescribed for the Previous year. Even though the law came into effect from 1st October 2020, to avoid unnecessary disputes and saving time, it is advisable in case of the buyer for whom the aggregate Sale Consideration received already exceeded ` 50 lakhs on or before 30-09-2020, the seller shall collect 0.1% on the Sale consideration received on or after 01-10-2020. In case, the aggregate Sale Consideration from the buyer doesn’t exceed ` 50 lakhs, it is advisable to collect 0.1% of Sale Consideration at the time of receipt of the amount exceeding 50 lakhs.<\/p><p><strong>Note:<\/strong> For Financial Year 2020- 21 – 0.075% is rate of TC S as per Press Release of CBDT dated 13th May 2020<\/p><p> <\/p><ol start=\"12\"><li><strong>Whether the Seller who had a turnover of <\/strong>` <strong>15 crores in the Financial Year 2019-20 and projected to have <\/strong>` <strong>7 crores in Financial Year 2020-21, is liable to collect tax at source for the Financial Year 2020-21?<\/strong><\/li><\/ol><p>Yes, since the sales in the preceding Financial Year 2019- 20 exceeds ` 10 crores, the seller is liable to collect tax from the buyers from whom, receipt of Consideration of Sale exceeds 50 lakhs.<\/p><p> <\/p><ol start=\"13\"><li><strong> Whether the Seller who had a turnover of 7 crores in the Financial Year 2019- 20 and projected to have<\/strong> <strong>Rs<\/strong> <strong>15 crores in Financial Year 2020-21, is liable to collect tax at source for the Financial Year 2020-21?<\/strong><\/li><\/ol><p>No, since the sales in the Preceding Financial Year 2019-20 does not exceed ` 10 crores, the seller is not liable to collect tax from the buyers u\/s 206C(1H).<\/p><p> <\/p><ol start=\"14\"><li><strong>What shall be the tax collected at source, for the Financial year 2020-21, if a seller has made sale of goods to a buyer for <\/strong>` <strong>30,00,000 up to 30th September 2020 and from 1st October 2020 to 31<\/strong><strong>st <\/strong><strong>March 2021 has made a sale to the aforementioned buyer for 25,00,000?<\/strong><\/li><\/ol><p> <\/p><p>In this scenario, the seller is liable to collect tax on the amount exceeding ` 50,00,000, and TCS shall be collected at 0.1% <strong>(for the<\/strong> <strong>Financial year 2020-21 – rate is<\/strong> <strong>0.075%)                                                                                                        <\/strong><\/p><p>Tax Collected at Source = [(`30,00,000+` 25,00,000) &#8211; ` 50,00,000 ] x 0.075% = ` 375<\/p><p> <\/p><ol start=\"15\"><li><strong> What shall be the tax collected at source, for the Financial year 2020-21, if a seller has made sale of goods to a buyer for <\/strong>` <strong>80,00,000 up to 30th September 2020 and from 1st October 2020 to 31st March 2021 has made a sale to the aforementioned buyer for <\/strong>` <strong>25,00,000?<\/strong><\/li><\/ol><p>Since the section is applicable only from 1st October 2020, Tax shall be collected at source prospectively from 1st October 2020. Since the Turnover\/sale has exceeded ` 50 lakhs on the first half of the Financial year 2020-21. The seller in my opinion is liable to collect tax at source on the entire 25,00,000 in the second half of the year at 0.075% (as per Press Release dated 13th May 2020) Tax Collected at Source = 25,00,000 x 0.075% = ` 1,875<\/p><p> <\/p><ol start=\"16\"><li><strong>Whether Sales Consideration includes any other Charges as well as Goods and Service Taxes if it is forming part of Sales Invoice?<\/strong><\/li><\/ol><p>The charging section specifies with the words Any amount as Consideration for Sale of any goods and it doesn’t mention sale value or Price of the goods. To avoid unnecessary disputes, it is better to Collect tax on the entire amount of Invoice (including Taxes and Duties and other levies).<\/p><p> <\/p><ol start=\"17\"><li><strong> What is the application of the Provision of law in case of advance received towards sales consideration?<\/strong><\/li><\/ol><p>The tax is to be collected at the time of receipt of such amount from the buyer and so whether the amount is received prior to sale as an advance or after-sale if the aggregate value of Sale Consideration during the previous year exceeds ` 50 lakhs, the seller is liable to collect tax at source. Hence it is the duty of the seller to collect TCS at 0.1% at the time of receipt of advance money from the buyer to whom this provision applies.<\/p><p> <\/p><ol start=\"18\"><li><strong>In Case of Works Contract liable u\/s 194C, whether Contractor Liable to collect this tax?<\/strong><\/li><\/ol><p><strong>Situation 1<\/strong>: Composite Contract for Both Supply of Material and other services and the invoice is raised as both supply of goods as well as services together, then TDS may be deducted by the Contractee on the whole value of Invoice u\/s 194C. In that case, TCS u\/s 206C(1H) shall not apply.<\/p><p> <\/p><p><strong>Situation 2: <\/strong>Composite Contract for Both Supply of Material and other services and the invoice is raised separately for supply of goods as well as supply of services, then TDS may be deducted by  the Contractee u\/s 194C for the supply of services and Tax must be collected u\/s 206C(1H) on the Sale of goods.<\/p><p> <\/p><ol start=\"19\"><li><strong>When should Tax collected at source be remitted to the government?<\/strong><\/li><\/ol><p>The Tax collected at Source shall be remitted to the government on 7th day of succeeding month from the month in which tax is collected at source.<\/p><p> <\/p><ol start=\"20\"><li><strong>When should the Statement showing the Tax collected at source u\/s 206C(1H) be filed?<\/strong><\/li><\/ol><p> A Quarterly Return in Form 27EQ shall be filed for Tax Collected at Source u\/s 206C(1H)<\/p>\t\t\t\t\t<\/div>\n\t\t\t\t\t\t<\/div>\n\t\t\t\t<\/div>\n\t\t\t\t\t\t<\/div>\n\t\t\t\t\t<\/div>\n\t\t<\/div>\n\t\t\t\t\t\t\t\t<\/div>\n\t\t\t\t\t<\/div>\n\t\t<\/section>\n\t\t\t\t\t\t<\/div>\n\t\t\t\t\t\t<\/div>\n\t\t\t\t\t<\/div>\n\t\t","protected":false},"excerpt":{"rendered":"<p>Vide the Finance Act, 2020, a new provision under section 206C(1H) was introduced for Collection of Tax at Source on Sale of Goods by a seller(whose Aggregate Gross Receipts or Sales or Turnover in preceding Financial Year exceeds `10 crores), from the buyers, from whom he has received any amount as Consideration for Sale exceeding ` 50 lakhs during the year. The aforesaid provisions are applicable from the 1st day of October 2020. The above sale of goods excludes the Sale of Motor Vehicles and other specified goods.<\/p>\n","protected":false},"author":1,"featured_media":6697,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":{"_monsterinsights_skip_tracking":false,"_monsterinsights_sitenote_active":false,"_monsterinsights_sitenote_note":"","_monsterinsights_sitenote_category":0,"footnotes":""},"categories":[114],"tags":[],"yoast_head":"<!-- This site is optimized with the Yoast SEO plugin v22.4 - https:\/\/yoast.com\/wordpress\/plugins\/seo\/ -->\n<title>All About TCS on Sales Consideration under section 206 C(1H) With FAQ&#039;S - Book My Consultants<\/title>\n<meta name=\"robots\" content=\"index, follow, max-snippet:-1, max-image-preview:large, max-video-preview:-1\" \/>\n<link rel=\"canonical\" href=\"https:\/\/bookmyconsultants.com\/all-about-tcs-on-sales-consideration-under-section-206-c1h-with-faqs\/\" \/>\n<meta property=\"og:locale\" content=\"en_US\" \/>\n<meta property=\"og:type\" content=\"article\" \/>\n<meta property=\"og:title\" content=\"All About TCS on Sales Consideration under section 206 C(1H) With FAQ&#039;S - Book My Consultants\" \/>\n<meta property=\"og:description\" content=\"Vide the Finance Act, 2020, a new provision under section 206C(1H) was introduced for Collection of Tax at Source on Sale of Goods by a seller(whose Aggregate Gross Receipts or Sales or Turnover in preceding Financial Year exceeds `10 crores), from the buyers, from whom he has received any amount as Consideration for Sale exceeding ` 50 lakhs during the year. The aforesaid provisions are applicable from the 1st day of October 2020. The above sale of goods excludes the Sale of Motor Vehicles and other specified goods.\" \/>\n<meta property=\"og:url\" content=\"https:\/\/bookmyconsultants.com\/all-about-tcs-on-sales-consideration-under-section-206-c1h-with-faqs\/\" \/>\n<meta property=\"og:site_name\" content=\"Book My Consultants\" \/>\n<meta property=\"article:published_time\" content=\"2020-10-14T06:05:00+00:00\" \/>\n<meta property=\"article:modified_time\" content=\"2021-04-09T07:25:24+00:00\" \/>\n<meta property=\"og:image\" content=\"https:\/\/bookmyconsultants.com\/wp-content\/uploads\/2021\/02\/2.jpg\" \/>\n\t<meta property=\"og:image:width\" content=\"310\" \/>\n\t<meta property=\"og:image:height\" content=\"163\" \/>\n\t<meta property=\"og:image:type\" content=\"image\/jpeg\" \/>\n<meta name=\"author\" content=\"bookmyconsultants\" \/>\n<meta name=\"twitter:card\" content=\"summary_large_image\" \/>\n<meta name=\"twitter:label1\" content=\"Written by\" \/>\n\t<meta name=\"twitter:data1\" content=\"bookmyconsultants\" \/>\n\t<meta name=\"twitter:label2\" content=\"Est. reading time\" \/>\n\t<meta name=\"twitter:data2\" content=\"2 minutes\" \/>\n<script type=\"application\/ld+json\" class=\"yoast-schema-graph\">{\"@context\":\"https:\/\/schema.org\",\"@graph\":[{\"@type\":\"WebPage\",\"@id\":\"https:\/\/bookmyconsultants.com\/all-about-tcs-on-sales-consideration-under-section-206-c1h-with-faqs\/\",\"url\":\"https:\/\/bookmyconsultants.com\/all-about-tcs-on-sales-consideration-under-section-206-c1h-with-faqs\/\",\"name\":\"All About TCS on Sales Consideration under section 206 C(1H) With FAQ'S - Book My Consultants\",\"isPartOf\":{\"@id\":\"https:\/\/bookmyconsultants.com\/#website\"},\"primaryImageOfPage\":{\"@id\":\"https:\/\/bookmyconsultants.com\/all-about-tcs-on-sales-consideration-under-section-206-c1h-with-faqs\/#primaryimage\"},\"image\":{\"@id\":\"https:\/\/bookmyconsultants.com\/all-about-tcs-on-sales-consideration-under-section-206-c1h-with-faqs\/#primaryimage\"},\"thumbnailUrl\":\"https:\/\/bookmyconsultants.com\/wp-content\/uploads\/2021\/02\/2.jpg\",\"datePublished\":\"2020-10-14T06:05:00+00:00\",\"dateModified\":\"2021-04-09T07:25:24+00:00\",\"author\":{\"@id\":\"https:\/\/bookmyconsultants.com\/#\/schema\/person\/0d3d4077ba476b8f52f6a2e7dba299ce\"},\"breadcrumb\":{\"@id\":\"https:\/\/bookmyconsultants.com\/all-about-tcs-on-sales-consideration-under-section-206-c1h-with-faqs\/#breadcrumb\"},\"inLanguage\":\"en-US\",\"potentialAction\":[{\"@type\":\"ReadAction\",\"target\":[\"https:\/\/bookmyconsultants.com\/all-about-tcs-on-sales-consideration-under-section-206-c1h-with-faqs\/\"]}]},{\"@type\":\"ImageObject\",\"inLanguage\":\"en-US\",\"@id\":\"https:\/\/bookmyconsultants.com\/all-about-tcs-on-sales-consideration-under-section-206-c1h-with-faqs\/#primaryimage\",\"url\":\"https:\/\/bookmyconsultants.com\/wp-content\/uploads\/2021\/02\/2.jpg\",\"contentUrl\":\"https:\/\/bookmyconsultants.com\/wp-content\/uploads\/2021\/02\/2.jpg\",\"width\":310,\"height\":163},{\"@type\":\"BreadcrumbList\",\"@id\":\"https:\/\/bookmyconsultants.com\/all-about-tcs-on-sales-consideration-under-section-206-c1h-with-faqs\/#breadcrumb\",\"itemListElement\":[{\"@type\":\"ListItem\",\"position\":1,\"name\":\"Home\",\"item\":\"https:\/\/bookmyconsultants.com\/\"},{\"@type\":\"ListItem\",\"position\":2,\"name\":\"All About TCS on Sales Consideration under section 206 C(1H) With FAQ&#8217;S\"}]},{\"@type\":\"WebSite\",\"@id\":\"https:\/\/bookmyconsultants.com\/#website\",\"url\":\"https:\/\/bookmyconsultants.com\/\",\"name\":\"Book My Consultants\",\"description\":\"You Grow We Grow\",\"potentialAction\":[{\"@type\":\"SearchAction\",\"target\":{\"@type\":\"EntryPoint\",\"urlTemplate\":\"https:\/\/bookmyconsultants.com\/?s={search_term_string}\"},\"query-input\":\"required name=search_term_string\"}],\"inLanguage\":\"en-US\"},{\"@type\":\"Person\",\"@id\":\"https:\/\/bookmyconsultants.com\/#\/schema\/person\/0d3d4077ba476b8f52f6a2e7dba299ce\",\"name\":\"bookmyconsultants\",\"image\":{\"@type\":\"ImageObject\",\"inLanguage\":\"en-US\",\"@id\":\"https:\/\/bookmyconsultants.com\/#\/schema\/person\/image\/\",\"url\":\"https:\/\/secure.gravatar.com\/avatar\/01a9eb42694f2ff1ae4ffc9bd4b30bf8?s=96&d=mm&r=g\",\"contentUrl\":\"https:\/\/secure.gravatar.com\/avatar\/01a9eb42694f2ff1ae4ffc9bd4b30bf8?s=96&d=mm&r=g\",\"caption\":\"bookmyconsultants\"},\"sameAs\":[\"http:\/\/bookmyconsultants.com\"],\"url\":\"https:\/\/bookmyconsultants.com\/author\/bookmyconsultants\/\"}]}<\/script>\n<!-- \/ Yoast SEO plugin. -->","yoast_head_json":{"title":"All About TCS on Sales Consideration under section 206 C(1H) With FAQ'S - Book My Consultants","robots":{"index":"index","follow":"follow","max-snippet":"max-snippet:-1","max-image-preview":"max-image-preview:large","max-video-preview":"max-video-preview:-1"},"canonical":"https:\/\/bookmyconsultants.com\/all-about-tcs-on-sales-consideration-under-section-206-c1h-with-faqs\/","og_locale":"en_US","og_type":"article","og_title":"All About TCS on Sales Consideration under section 206 C(1H) With FAQ'S - Book My Consultants","og_description":"Vide the Finance Act, 2020, a new provision under section 206C(1H) was introduced for Collection of Tax at Source on Sale of Goods by a seller(whose Aggregate Gross Receipts or Sales or Turnover in preceding Financial Year exceeds `10 crores), from the buyers, from whom he has received any amount as Consideration for Sale exceeding ` 50 lakhs during the year. The aforesaid provisions are applicable from the 1st day of October 2020. The above sale of goods excludes the Sale of Motor Vehicles and other specified goods.","og_url":"https:\/\/bookmyconsultants.com\/all-about-tcs-on-sales-consideration-under-section-206-c1h-with-faqs\/","og_site_name":"Book My Consultants","article_published_time":"2020-10-14T06:05:00+00:00","article_modified_time":"2021-04-09T07:25:24+00:00","og_image":[{"width":310,"height":163,"url":"https:\/\/bookmyconsultants.com\/wp-content\/uploads\/2021\/02\/2.jpg","type":"image\/jpeg"}],"author":"bookmyconsultants","twitter_card":"summary_large_image","twitter_misc":{"Written by":"bookmyconsultants","Est. reading time":"2 minutes"},"schema":{"@context":"https:\/\/schema.org","@graph":[{"@type":"WebPage","@id":"https:\/\/bookmyconsultants.com\/all-about-tcs-on-sales-consideration-under-section-206-c1h-with-faqs\/","url":"https:\/\/bookmyconsultants.com\/all-about-tcs-on-sales-consideration-under-section-206-c1h-with-faqs\/","name":"All About TCS on Sales Consideration under section 206 C(1H) With FAQ'S - Book My Consultants","isPartOf":{"@id":"https:\/\/bookmyconsultants.com\/#website"},"primaryImageOfPage":{"@id":"https:\/\/bookmyconsultants.com\/all-about-tcs-on-sales-consideration-under-section-206-c1h-with-faqs\/#primaryimage"},"image":{"@id":"https:\/\/bookmyconsultants.com\/all-about-tcs-on-sales-consideration-under-section-206-c1h-with-faqs\/#primaryimage"},"thumbnailUrl":"https:\/\/bookmyconsultants.com\/wp-content\/uploads\/2021\/02\/2.jpg","datePublished":"2020-10-14T06:05:00+00:00","dateModified":"2021-04-09T07:25:24+00:00","author":{"@id":"https:\/\/bookmyconsultants.com\/#\/schema\/person\/0d3d4077ba476b8f52f6a2e7dba299ce"},"breadcrumb":{"@id":"https:\/\/bookmyconsultants.com\/all-about-tcs-on-sales-consideration-under-section-206-c1h-with-faqs\/#breadcrumb"},"inLanguage":"en-US","potentialAction":[{"@type":"ReadAction","target":["https:\/\/bookmyconsultants.com\/all-about-tcs-on-sales-consideration-under-section-206-c1h-with-faqs\/"]}]},{"@type":"ImageObject","inLanguage":"en-US","@id":"https:\/\/bookmyconsultants.com\/all-about-tcs-on-sales-consideration-under-section-206-c1h-with-faqs\/#primaryimage","url":"https:\/\/bookmyconsultants.com\/wp-content\/uploads\/2021\/02\/2.jpg","contentUrl":"https:\/\/bookmyconsultants.com\/wp-content\/uploads\/2021\/02\/2.jpg","width":310,"height":163},{"@type":"BreadcrumbList","@id":"https:\/\/bookmyconsultants.com\/all-about-tcs-on-sales-consideration-under-section-206-c1h-with-faqs\/#breadcrumb","itemListElement":[{"@type":"ListItem","position":1,"name":"Home","item":"https:\/\/bookmyconsultants.com\/"},{"@type":"ListItem","position":2,"name":"All About TCS on Sales Consideration under section 206 C(1H) With FAQ&#8217;S"}]},{"@type":"WebSite","@id":"https:\/\/bookmyconsultants.com\/#website","url":"https:\/\/bookmyconsultants.com\/","name":"Book My Consultants","description":"You Grow We Grow","potentialAction":[{"@type":"SearchAction","target":{"@type":"EntryPoint","urlTemplate":"https:\/\/bookmyconsultants.com\/?s={search_term_string}"},"query-input":"required name=search_term_string"}],"inLanguage":"en-US"},{"@type":"Person","@id":"https:\/\/bookmyconsultants.com\/#\/schema\/person\/0d3d4077ba476b8f52f6a2e7dba299ce","name":"bookmyconsultants","image":{"@type":"ImageObject","inLanguage":"en-US","@id":"https:\/\/bookmyconsultants.com\/#\/schema\/person\/image\/","url":"https:\/\/secure.gravatar.com\/avatar\/01a9eb42694f2ff1ae4ffc9bd4b30bf8?s=96&d=mm&r=g","contentUrl":"https:\/\/secure.gravatar.com\/avatar\/01a9eb42694f2ff1ae4ffc9bd4b30bf8?s=96&d=mm&r=g","caption":"bookmyconsultants"},"sameAs":["http:\/\/bookmyconsultants.com"],"url":"https:\/\/bookmyconsultants.com\/author\/bookmyconsultants\/"}]}},"_links":{"self":[{"href":"https:\/\/bookmyconsultants.com\/wp-json\/wp\/v2\/posts\/6694"}],"collection":[{"href":"https:\/\/bookmyconsultants.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/bookmyconsultants.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/bookmyconsultants.com\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"https:\/\/bookmyconsultants.com\/wp-json\/wp\/v2\/comments?post=6694"}],"version-history":[{"count":9,"href":"https:\/\/bookmyconsultants.com\/wp-json\/wp\/v2\/posts\/6694\/revisions"}],"predecessor-version":[{"id":6801,"href":"https:\/\/bookmyconsultants.com\/wp-json\/wp\/v2\/posts\/6694\/revisions\/6801"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/bookmyconsultants.com\/wp-json\/wp\/v2\/media\/6697"}],"wp:attachment":[{"href":"https:\/\/bookmyconsultants.com\/wp-json\/wp\/v2\/media?parent=6694"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/bookmyconsultants.com\/wp-json\/wp\/v2\/categories?post=6694"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/bookmyconsultants.com\/wp-json\/wp\/v2\/tags?post=6694"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}